Documents/Монтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Монтаж</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СвободныеМонтажники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Монтажник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Монтаж/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Переделки
	//МассивПеределки = ЛексСервер.НайтиПодчиненныеДокументы(Объект.Ссылка, "Документ.Переделка", "Монтаж");
	//Если МассивПеределки.Количество() = 1 Тогда
	//	Переделки = МассивПеределки[0];
	//ИначеЕсли МассивПеределки.Количество() = 0 Тогда
	//	Переделки = "Ввести Переделку";
	//Иначе
	//	Переделки = "Ошибка связи документа Переделки с Графиком монтажа";
	//КонецЕсли;
	
	Если Параметры.Свойство("Спецификация") Тогда
		
		Спецификация 				= Параметры.Спецификация;
		Объект.Подразделение 	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(Спецификация, "Подразделение");
		Объект.Спецификация 	= Спецификация;
		Объект.ДатаМонтажа 		= ОбщегоНазначения.ПолучитьЗначениеРеквизита(Спецификация, "ДатаМонтажа");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьИзделия(Команда)
	
	 ПеречитатьИзделияСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьИзделияСервер()

	ДокументОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.Монтаж"));
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	Объект.ДатаМонтажа = ДокументОбъект.Спецификация.ДатаМонтажа;
	
КонецПроцедуры //ПеречитатьИзделияСервер ()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ ВладелецФормы = Неопределено Тогда
		
		ЗакрыватьПриВыборе = Ложь;
		ОповеститьОВыборе(Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры
